//     heomer.js 1.0.0
//     http://he-Date.info/site.html
//     (c) 2014 (ה'תשע"ה) - daniel levanon (daniellevanon@gmail.com)
//     Heomer may be freely distributed under the MIT license.
function omer(heDate,display){
    var days=heDate.getTime()-(new HeDate(heDate.getYear(),8,15)).getTime();
	if (days>=1 && days<=49){
		if (display==0)
			return days;
		else 
			var show= new Array(50);
			show[1]="היום יום אחד לעומר"; show[2]="היום שני ימים לעומר"; show[3]="היום שלושה ימים לעומר";
			show[4]="היום ארבעה ימים לעומר"; show[5]="היום חמישה ימים לעומר"; show[6]="היום שישה ימים לעומר";
			show[7]="היום שיבעה ימים לעומר, שהם שבוע אחד"; show[8]="היום שמונה ימים לעומר, שהם שבוע אחד ויום אחד"; show[9]="היום תישעה ימים לעומר, שהם שבוע אחד ושני ימים";
			show[10]="היום עשרה ימים לעומר, שהם שבוע אחד ושלושה ימים"; show[11]="היום אחד עשר יום לעומר, שהם שבוע אחד וארבעה ימים"; show[12]="היום שנים עשר יום לעומר, שהם שבוע אחד וחמישה ימים";
			show[13]="היום שלושה עשר יום לעומר, שהם שבוע אחד ושישה ימים"; show[14]="היום ארבעה עשר יום לעומר, שהם שני שבועות"; show[15]="היום חמישה עשר יום לעומר, שהם שני שבועות ויום אחד";
			show[16]="היום שישה עשר יום לעומר, שהם שני שבועות ושני ימים"; show[17]="היום שיבעה עשר יום לעומר, שהם שני שבועות ושלושה ימים"; show[18]="היום שמונה עשר יום לעומר, שהם שני שבועות וארבעה ימים";
			show[19]="היום תישעה עשר יום לעומר, שהם שני שבועות וחמישה ימים"; show[20]="היום עשרים יום לעומר, שהם שני שבועות ושישה ימים"; show[21]="היום אחד ועשרים יום לעומר, שהם שלושה שבועות";
			show[22]="היום שנים ועשרים יום לעומר, שהם שלושה שבועות ויום אחד"; show[23]="היום שלושה ועשרים יום לעומר, שהם שלושה שבועות ושני ימים"; show[24]="היום ארבעה ועשרים יום לעומר, שהם שלושה שבועות ושלושה ימים";
			show[25]="היום חמישה ועשרים יום לעומר, שהם שלושה שבועות וארבעה ימים"; show[26]="היום שישה ועשרים יום לעומר, שהם שלושה שבועות וחמישה ימים"; show[27]="היום שיבעה ועשרים יום לעומר, שהם שלושה שבועות ושישה ימים";
			show[28]="היום שמונה ועשרים יום לעומר, שהם ארבעה שבועות"; show[29]="היום תישעה ועשרים יום לעומר, שהם ארבעה שבועות ויום אחד"; show[30]="היום שלושים יום לעומר, שהם ארבעה שבועות ושני ימים";
			show[31]="היום אחד ושלושים יום לעומר, שהם ארבעה שבועות ושלושה ימים"; show[32]="היום שנים ושלושים יום לעומר, שהם ארבעה שבועות וארבעה ימים"; show[33]="היום שלושה ושלושים יום לעומר, שהם ארבעה שבועות וחמישה ימים";
			show[34]="היום ארבעה ושלושים יום לעומר, שהם ארבעה שבועות ושישה ימים"; show[35]="היום חמישה ושלושים יום לעומר, שהם חמישה שבועות"; show[36]="היום שישה ושלושים יום לעומר, שהם חמישה שבועות ויום אחד";
			show[37]="היום שיבעה ושלושים יום לעומר, שהם חמישה שבועות ושני ימים"; show[38]="היום שמונה ושלושים יום לעומר, שהם חמישה שבועות ושלושה ימים"; show[39]="היום תישעה ושלושים יום לעומר, שהם חמישה שבועות וארבעה ימים";
			show[40]="היום ארבעים יום לעומר, שהם חמישה שבועות וחמישה ימים"; show[41]="היום אחד וארבעים יום לעומר, שהם חמישה שבועות ושישה ימים"; show[42]="היום שנים וארבעים יום לעומר, שהם שישה שבועות";
			show[43]="היום שלושה וארבעים יום לעומר, שהם שישה שבועות ויום אחד"; show[44]="היום ארבעה וארבעים יום לעומר, שהם שישה שבועות ושני ימים"; show[45]="היום חמישה וארבעים יום לעומר, שהם שישה שבועות ושלושה ימים";
			show[46]="היום שישה וארבעים יום לעומר, שהם שישה שבועות וארבעה ימים"; show[47]="היום שיבעה וארבעים יום לעומר, שהם שישה שבועות וחמישה ימים"; show[48]="היום שמונה וארבעים יום לעומר, שהם שישה שבועות ושישה ימים";
			show[49]="היום תישעה וארבעים יום לעומר, שהם שיבעה שבועות";
			return show[days];
		}
	else{
		return null;
	}
	
}